# Essential Functionality

## 1. Arithmetic and Data Alignment

### 1.1 Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
series_1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
series_2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [3]:
series_1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [4]:
series_2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [5]:
#indexes that overlaped are added, missing ones return NaN
series_1 + series_2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

### 1.2 DataFrame

In [6]:
dataframe_1 = pd.DataFrame(np.arange(9.).reshape((3, 3)),
                           index=['Ohio', 'Texas', 'Colorado'],
                           columns=list('bcd'))

In [7]:
dataframe_2 = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                           index=['Utah', 'Ohio', 'Texas', 'Oregon'],
                           columns=list('bde'))

In [8]:
dataframe_1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [9]:
dataframe_2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [10]:
#adding these 2 dataframes returns values if columns and index ids appears on both of dataframes
#union is outputed, since c and e, Colorado, Oregon, utah don't appear on both => they return NaN
dataframe_1 + dataframe_2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [11]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})

In [12]:
df1

   A
0  1
1  2

In [13]:
df2

   B
0  3
1  4

In [14]:
#No column/row in common
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

### 1.3 Arithmetic methods with fill values
* Adding a certain value to the added DataFrame objects

In [15]:
dataframe_1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                           columns=list('abcd'))

In [16]:
dataframe_2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                           columns=list('abcde'))

In [17]:
dataframe_2.loc[1, 'b'] = np.nan

In [18]:
dataframe_1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [19]:
dataframe_2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [20]:
dataframe_1 + dataframe_2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [21]:
#for NaN grids => dataframe_2 fills its own values dataframe_2 + fill_value
dataframe_1.add(dataframe_2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [22]:
# scalar is applied to each item
1 / dataframe_1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [23]:
#alternatively
dataframe_1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [24]:
#reindexing problem => df2 'e' column is added to df1 with 0 values in it
dataframe_1.reindex(columns=dataframe_2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

### 1.4 Operations between DataFrame and Series

In [25]:
#numpy broadcasting
array = np.arange(12).reshape((3, 4))
array[0]

array([0, 1, 2, 3])

In [26]:
array - array[0]

array([[0, 0, 0, 0],
       [4, 4, 4, 4],
       [8, 8, 8, 8]])

In [27]:
#pandas broadcasting over rows
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'],
                     columns=list('bde'))

In [28]:
series = frame.iloc[0]

In [29]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [30]:
series

b    0
d    1
e    2
Name: Utah, dtype: int32

In [31]:
frame - series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [32]:
#broadcasting over columns => axis=1
series_3 = frame['d']

In [33]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [34]:
series_3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: int32

In [35]:
frame.sub(series_3, axis='index')

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

## 2. Function Application and Mapping

In [36]:
frame = pd.DataFrame(np.random.randn(4, 3),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'],
                     columns=list('bde'))

In [37]:
frame

               b         d         e
Utah    0.511187 -0.556977 -0.263534
Ohio   -0.078133  0.467818 -1.064592
Texas   0.619490  1.480441  0.886412
Oregon  0.910390 -0.147150  0.089292

In [38]:
#applying Numpy ufuncs to the pd.DataFrame
np.abs(frame)

               b         d         e
Utah    0.511187  0.556977  0.263534
Ohio    0.078133  0.467818  1.064592
Texas   0.619490  1.480441  0.886412
Oregon  0.910390  0.147150  0.089292

### 2.1 apply()

In [39]:
function = lambda x: x.max() - x.min()

#function takes a max and min value from each column and outputs the arithmetic that you defined
#each column has its own output

frame.apply(function, axis=0)

b    0.988524
d    2.037418
e    1.951004
dtype: float64

In [40]:
frame.apply(function, axis=1)

Utah      1.068164
Ohio      1.532410
Texas     0.860951
Oregon    1.057540
dtype: float64

* apply() has the same history with built-in apply() => use DataFrame methods regularly

In [41]:
def function(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [42]:
frame.apply(function, axis=0)

            b         d         e
min -0.078133 -0.556977 -1.064592
max  0.910390  1.480441  0.886412

### 2.2 applymap()

In [43]:
formatted = lambda x: '%.2f' % x

In [44]:
frame.applymap(formatted)

            b      d      e
Utah     0.51  -0.56  -0.26
Ohio    -0.08   0.47  -1.06
Texas    0.62   1.48   0.89
Oregon   0.91  -0.15   0.09

## 3. Sorting and Ranking
* Sorting index rows and columns lexigrophically

In [45]:
series = pd.Series(np.arange(4), index=list('dbac'))
series

d    0
b    1
a    2
c    3
dtype: int32

### 3.1 Series sorting

In [46]:
series.sort_index()

a    2
b    1
c    3
d    0
dtype: int32

### 3.2 DataFrame sorting
* Either axes

In [47]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=list('dbac'))

In [48]:
#by default, rows are sorted
frame.sort_index()

       d  b  a  c
one    4  5  6  7
three  0  1  2  3

* `NOTATION`
** if there is gap on row indexes or columns => axis=0 is for rows, axis=1 for columns

In [49]:
frame.sort_index(axis=1)

       a  b  c  d
three  2  1  3  0
one    6  5  7  4

In [50]:
#sorting in descending order
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  1  2
one    4  7  5  6

### 3.3 Sorting by Values

#### 3.3.1 Series

In [51]:
series = pd.Series([4, 7, -5, 3])
series.sort_values()

2   -5
3    3
0    4
1    7
dtype: int64

In [52]:
#any NaN value is sorted at the end
series = pd.Series([4, np.nan, 7, -5, np.nan, 3])
series.sort_values()

3   -5.0
5    3.0
0    4.0
2    7.0
1    NaN
4    NaN
dtype: float64

#### 3.3.2 DataFrame

In [53]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [54]:
#sort key is defined via 'by' keyword
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [55]:
#multiple columns sort
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

### 3.4 Ranking

#### 3.4.1 Series

In [56]:
# the 0.5 values outputed due to meeting 2/more equal values => they share -0.5 +0.5 place
#pandas deicdes to split by 0.5 for them => NO: 3, 4; YES: 3.5, 3.5
#eng kichkinasi, eng baland orinda; default is ascending

series = pd.Series([1, 3, 4, 3, 2, 6])
series.rank()

0    1.0
1    3.5
2    5.0
3    3.5
4    2.0
5    6.0
dtype: float64

In [57]:
#almost the same with default rank(), but it outputs whole integer
#if values are equal, label indexes are compared
series.rank(method='first')

0    1.0
1    3.0
2    5.0
3    4.0
4    2.0
5    6.0
dtype: float64

In [58]:
#ranking in descending order
#Eng kattasi, eng baland orinda

series.rank(ascending=False, method='max')

0    6.0
1    4.0
2    2.0
3    4.0
4    5.0
5    1.0
dtype: float64

#### 3.4.2 DataFrame
* Can rank on either axes

In [59]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2],
                      'a': [0, 1, 0, 1], 
                      'c': [-2, 5, 8, -2.5]})

In [60]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [61]:
#rows values ranking
#chapdan ongga
frame.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [62]:
#column values ranking
#tepadan pastga
frame.rank(axis=0)

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

## 4. Axis Indexes with Duplicate Labels

### 4.1 Series

In [63]:
#reindex() requires unique lables
series = pd.Series(np.arange(5), index=list('aabbc'))
series

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [64]:
#wheter indexes are unique or not
series.index.is_unique

False

In [65]:
#returns multiple values
series['a']

a    0
a    1
dtype: int32

In [66]:
series['c']

4

### 4.2 DataFrame

In [67]:
dataframe = pd.DataFrame(np.random.randn(4, 3), index=list('aabb'))
dataframe

          0         1         2
a -0.101631 -0.134726  0.759467
a -1.350760 -0.511714 -0.833218
b -0.275773 -0.404542 -0.315923
b -0.154574  0.395699 -0.216075

In [68]:
#for dataframe use 'dataframe.loc[]' syntax to access the row axes
dataframe.loc['b']

          0         1         2
b -0.275773 -0.404542 -0.315923
b -0.154574  0.395699 -0.216075